Revit 2027 API
NavisworksExportOptions.FacetingFactor Property
 Faceting factor. Default value is 1.0.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double FacetingFactor { get; set; }
Public Property FacetingFactor As Double
	Get
	Set
public:
property double FacetingFactor {
	double get ();
	void set (double value);
}
member FacetingFactor : float with get, set
Property Value
Double
See Also
Reference
NavisworksExportOptions Class
Autodesk.Revit.DB Namespace